In [1]:
import pandas as pd
#cria um DataFrame
data = {'Empresa':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Nome':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Venda':[200, 120, 340, 124, 243, 350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
group = df.groupby('Empresa')
group

In [10]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [11]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [12]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [13]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [14]:
group2 = df.groupby('Nome')

In [17]:
group2.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64